In [1]:
%load_ext sql
%reload_ext sql
%sql sqlite://

In [2]:
%%sql
CREATE TABLE Worker (
WORKER_ID INT,
FIRST_NAME CHAR(25),
LAST_NAME CHAR(25),
SALARY INT(15),
JOINING_DATE DATETIME,
DEPARTMENT CHAR(25)
);

 * sqlite://
Done.

[]

In [3]:
%%sql
INSERT INTO Worker VALUES(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR');
INSERT INTO Worker VALUES(2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin');
INSERT INTO Worker VALUES(3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR');
INSERT INTO Worker VALUES(4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin');
INSERT INTO Worker VALUES(5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin');
INSERT INTO Worker VALUES(6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account');
INSERT INTO Worker VALUES(7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account');
INSERT INTO Worker VALUES(8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

#### Q-1. Write an SQL query to print the FIRST_NAME from Worker table after replacing ‘a’ with ‘A’.

In [4]:
%%sql
select replace(first_name,'a','A') from worker

 * sqlite://
Done.

[('MonikA',),
 ('NihArikA',),
 ('VishAl',),
 ('AmitAbh',),
 ('Vivek',),
 ('Vipul',),
 ('SAtish',),
 ('GeetikA',)]

#### Q-2. Write an SQL query to print all Worker details from the Worker table order by FIRST_NAME Ascending and DEPARTMENT Descending.

In [7]:
%%sql
select * from worker order by first_name asc, department desc

 * sqlite://
Done.

[(4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
 (8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin'),
 (1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
 (7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account'),
 (6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
 (3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
 (5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin')]

#### Q-3. Write an SQL query to fetch the names of workers who earn the highest salary.

In [11]:
%%sql
select first_name,last_name from worker where salary =(select max(salary) from worker)

 * sqlite://
Done.

[('Amitabh', 'Singh'), ('Vivek', 'Bhati')]